chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* 給 photo.c：有待處理的按鍵指令就別把這張解完了。 */
static bool ctrl_waiting(void)
{
    return (g_req_pause != 0u);
}

static void button_init(void)
{
    GPIO_InitTypeDef btn = {0};

    LCD_BL_CTRL_GPIO_CLK_ENABLE();      /* brightness_set 從中斷呼叫，不碰 RCC */
    (void)BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

    /* BSP 只設下降邊緣（放開才觸發），量不出按了多久。改成雙邊緣。 */
    BUTTON_USER_GPIO_CLK_ENABLE();
    btn.Pin   = BUTTON_USER_PIN;
    btn.Mode  = GPIO_MODE_IT_RISING_FALLING;
    btn.Pull  = GPIO_PULLDOWN;
    btn.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(BUTTON_USER_GPIO_PORT, &btn);
}

/* 設定背光亮度（0~100）。0 等同關螢幕，播放也會一起暫停。
 *
 * 全程只呼叫 BSP_LCD_SetBrightness()，「不碰」BSP_LCD_DisplayOn/Off ——
 * 那兩支是 ST 的不對稱陷阱：DisplayOff 會把背光腳（GPIOG15）從 LPTIM 的
 * PWM 替代功能改成一般 GPIO 並拉低，DisplayOn 卻完全不碰它。結果是
 * 「關得掉、開不回來」，而且腳位一旦離開 AF 模式，亮度調節就整個失效。
 *
 * SetBrightness 只改 LPTIM 的比較值（佔空比），那支腳從頭到尾維持 AF，
 * 所以 0% 就是 PWM 歸零＝背光全滅，100% 就是全亮，中間任意檔位都可用。 */
static void brightness_set(uint32_t pct)
{
    GPIO_InitTypeDef bl = {0};

    g_brightness = pct;
    g_screen_on  = (pct > 0u);

    /* 這支函式會從中斷裡被呼叫，所以不碰 RCC —— 時脈在 button_init() 開好。
     * 剩下的只有 GPIO 與 LPTIM 的暫存器寫入，沒有其他人同時在動這兩個周邊。 */
    bl.Pull  = GPIO_NOPULL;
    bl.Speed = GPIO_SPEED_FREQ_MEDIUM;
    bl.Pin   = LCD_BL_CTRL_PIN;

    if (pct == 0u) {
        /* BSP 的亮度公式在 0 會整數下溢：
         *     Pulse = (10001 * 0 / 100) - 1 = 0 - 1 -> 0xFFFFFFFF
         * 比較值變成天文數字，PWM 永遠不翻轉，背光根本關不掉。
         * 所以 0% 不走 PWM，直接把腳位切成一般輸出並拉低。 */
        bl.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &bl);
        HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN,
                          GPIO_PIN_RESET);
        return;
    }

    /* 從 0% 回來時腳位還停在一般輸出，要先還原成 LPTIM 的替代功能，
     * 否則 SetBrightness 改了比較值也沒有用（腳位不歸 LPTIM 管）。 */
    bl.Mode      = GPIO_MODE_AF_PP;
    bl.Alternate = LCD_LPTIMx_CHANNEL_AF;
    HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &bl);

    (void)BSP_LCD_SetBrightness(0, pct);
}

/* 放在每個迴圈裡。回傳 true 代表螢幕是亮的（可以接受觸控）。
 * USER 鍵每按一次降一檔，到 0 之後回到 100。 */
/* 亮度已經在中斷裡套用了，這裡只回報「螢幕是不是亮的」，
 * 決定要不要繼續解碼與接受觸控。 */
static bool screen_poll(void)
{
    return g_screen_on;
}

/* ------------------------------------------------------------------ */
/* 掃描                                                                */
/* ------------------------------------------------------------------ */

static bool is_jpeg(const char *name)
{
    size_t n = strlen(name);
    const char *p;

    if (n >= 4U) {
        p = name + n - 4;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'g') {
            return true;
        }
    }
    if (n >= 5U) {
        p = name + n - 5;
        if (p[0] == '.' && (p[1] | 32) == 'j' && (p[2] | 32) == 'p' &&
            (p[3] | 32) == 'e' && (p[4] | 32) == 'g') {
            return true;
        }
    }
    return false;
}

static void add_photo(const char *path, uint32_t top)
{
    char *slot;

    if (g_photo_count >= MAX_PHOTOS) {
        g_skipped_full++;
        return;
    }
    if (strlen(path) >= PATH_MAX) {
        g_skipped_long++;
        return;
    }
    slot = PLAYLIST_BASE + g_photo_count * PATH_MAX;
    strncpy(slot, path, PATH_MAX - 1U);
    slot[PATH_MAX - 1U] = 0;
    TOPIDX_BASE[g_photo_count] = (uint8_t)top;
    g_photo_count++;
}

/* DIR 與 FILINFO 依深度放 BSS：FILINFO 帶 UTF-8 長檔名緩衝區約 800 位元組，
 * 遞迴十層放堆疊會爆掉。 */
static void scan(uint32_t depth)
{
    size_t base = strlen(g_scan_path);

    if (depth >= MAX_DEPTH) {
        return;
    }
    if (f_opendir(&g_dir[depth], g_scan_path) != FR_OK) {
        return;
    }

    for (;;) {
        FILINFO *fi = &g_fno[depth];
        size_t len;

        if (f_readdir(&g_dir[depth], fi) != FR_OK || fi->fname[0] == 0) {
            break;
        }
        if (fi->fname[0] == '.' || (fi->fattrib & (AM_SYS | AM_HID))) {
            continue;
        }
        watchdog_feed();

        len = strlen(fi->fname);
        if (base + 1U + len + 1U > SCAN_PATH_LEN) {
            continue;
        }
        g_scan_path[base] = '/';
        memcpy(&g_scan_path[base + 1U], fi->fname, len + 1U);

        if (fi->fattrib & AM_DIR) {
            if (depth == 0U) {
                if (g_top_count >= MAX_TOP) {
                    g_scan_path[base] = 0;
                    continue;
                }
                g_cur_top = g_top_count;
                strncpy(g_top[g_cur_top].name, fi->fname, NAME_MAX - 1U);
                g_top[g_cur_top].name[NAME_MAX - 1U] = 0;
                g_top[g_cur_top].selected = true;   /* 預設全選 */
                g_top_count++;
            }
            scan(depth + 1U);
        } else if (is_jpeg(fi->fname) && depth > 0U && g_cur_top < MAX_TOP) {
            add_photo(g_scan_path, g_cur_top);
            g_top[g_cur_top].photos++;

            /* 掃幾萬個檔案要花上數十秒，畫面一直停在「載入中」會像當機。
             * 每 200 張更新一次數字，讓使用者看得到它在動。 */
            if ((g_photo_count % 200u) == 0u) {
                show_scan_progress();
            }
        }

        g_scan_path[base] = 0;
    }

    f_closedir(&g_dir[depth]);
    g_scan_path[base] = 0;
}

static uint32_t selected_photo_count(void)
{
    uint32_t n = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        uint32_t t = TOPIDX_BASE[i];
        if (t < g_top_count && g_top[t].selected) {
            n++;
        }
    }
    return n;
}

/* 依目前的勾選建立播放順序，然後洗牌。 */
static void build_order(void)
{
    g_order_count = 0;
    for (uint32_t i = 0; i < g_photo_count; i++) {
        uint32_t t = TOPIDX_BASE[i];
        if (t < g_top_count && g_top[t].selected) {
            g_order[g_order_count++] = (uint16_t)i;
        }
    }

    /* Fisher-Yates。每次進播放都重洗，播完一輪也重洗，
     * 所以同一批照片不會每輪都同一個順序。 */
    for (uint32_t i = g_order_count; i > 1U; i--) {
        uint32_t j = rnd() % i;
        uint16_t tmp = g_order[i - 1U];
        g_order[i - 1U] = g_order[j];
        g_order[j] = tmp;
    }
}

/* ------------------------------------------------------------------ */
/* 影片                                                                */
/* ------------------------------------------------------------------ */

#define MAX_VIDEOS      16U

/* 影片清單只掃根目錄。
 *
 * 影格包動輒上百 MB，放根目錄是自然的擺法；而遞迴掃描每個 .bin 都要開檔
 * 讀檔頭，深層目錄裡如果有一堆無關的 .bin 會拖很久。照片那邊需要遞迴是
 * 因為使用者的相簿本來就有目錄結構，影片沒有這個需求。 */
static video_info_t g_vids[MAX_VIDEOS];
static uint32_t     g_vid_count;
volatile uint32_t   g_dbg_autovideo;   /* SWD 可寫，見主迴圈 */
volatile uint32_t   g_dbg_autoplay;    /* SWD 可寫，直接開始放照片 */

static bool ends_with_bin(const char *name)
{
    size_t n = strlen(name);

    if (n < 5u) {
        return false;
    }
    return (name[n - 4] == '.') &&
           (name[n - 3] == 'b' || name[n - 3] == 'B') &&
           (name[n - 2] == 'i' || name[n - 2] == 'I') &&
           (name[n - 1] == 'n' || name[n - 1] == 'N');
}

static void scan_videos(void)
{
    DIR     dir;
    FILINFO fno;

    g_vid_count = 0;
    if (f_opendir(&dir, "0:") != FR_OK) {
        return;
    }
    while (g_vid_count < MAX_VIDEOS) {
        if (f_readdir(&dir, &fno) != FR_OK || fno.fname[0] == 0) {
            break;
        }
        if ((fno.fattrib & AM_DIR) || !ends_with_bin(fno.fname)) {
            continue;
        }
        watchdog_feed();

        {
            video_info_t *v = &g_vids[g_vid_count];
            size_t        n = strlen(fno.fname);

