chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
/* 借用照片路徑的 YCbCr 區。暫停中不解碼，而按下任何按鈕之後都會**先還原
 * 畫面才去解碼**，兩者不會互相踩到。 */
#define CTL_SAVE     ((uint16_t *)0x90600000u)

#define OV_TOP_Y     36
#define OV_TOP_H     56
#define OV_PILL_W    120
#define OV_BACK_X    20
#define OV_ORIENT_X  ((int)GFX_W / 2 - OV_PILL_W / 2)
#define OV_PAUSE_X   ((int)GFX_W - 20 - OV_PILL_W)

/* 拉桿的幾何直接沿用影片疊加層的常數。 */
#define PB_X         40
#define PB_W         400
#define PB_Y         700
#define PB_H         14
#define PB_HIT       60
#define OV_BOT_Y     (PB_Y - 16)
#define OV_BOT_H     96

#define PAUSE_SEEK   5           /* 拉桿區域（內部用，不會回報出去） */
#define SEEK_MIN_DX  50          /* 拉多少才算數 */

static uint32_t g_ov_index;      /* 疊加層要顯示的張數（由 pause_session 給） */

/* 剛恢復播放的時刻。恢復之後短時間內不理會觸控 —— 否則同一次觸碰
 * （或放開瞬間的彈跳）會立刻又被播放迴圈判成「暫停」，症狀是
 * 「點一下播放不了」。實體鍵不會有這個問題，因為它是閂鎖旗標，
 * 不會被兩個迴圈各吃一次；使用者回報「只有實體鍵按得動」正是這個差別。 */
static uint32_t g_resume_ms;
#define RESUME_GUARD_MS  700u

/* 存還原一條橫帶（邏輯 y0 起算 h 列，整個畫布寬）。
 * 直立時邏輯 x 是實體列，所以沿著邏輯 y 走才連續。 */
static uint16_t *strip_backup(int y0, int h, uint16_t *sv, bool restore)
{
    uint16_t *front = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);

    for (int i = 0; i < (int)GFX_W; i++) {
        uint16_t *fb = front + (uint32_t)((int)GFX_W - 1 - i) * PHYS_W
                             + (uint32_t)y0;

        if (restore) { memcpy(fb, sv, (size_t)h * 2u); }
        else         { memcpy(sv, fb, (size_t)h * 2u); }
        sv += h;
    }
    return sv;
}

static void ctl_backup(bool restore)
{
    uint16_t *sv = CTL_SAVE;

    sv = strip_backup(OV_TOP_Y, OV_TOP_H, sv, restore);
    (void)strip_backup(OV_BOT_Y, OV_BOT_H, sv, restore);
}

/* 只重畫下方的拉桿。拖曳時每幾毫秒就要更新一次，不能整個疊加層重畫。 */
static void ov_draw_bar(uint32_t idx)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();
    uint32_t  total  = g_order_count ? g_order_count : 1u;
    uint32_t  done_w = (uint32_t)PB_W * idx / total;

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);

    gfx_fill_rect(0, OV_BOT_Y, (int)GFX_W, OV_BOT_H, COL_BG);
    gfx_fill_rect(PB_X, PB_Y, PB_W, PB_H, COL_LINE);
    if (done_w != 0u) {
        gfx_fill_rect(PB_X, PB_Y, (int)done_w, PB_H, COL_ACCENT);
    }
    gfx_fill_rect(PB_X + (int)done_w - 3, PB_Y - 8, 6, PB_H + 16, COL_TEXT);

    gfx_number(PB_X, PB_Y + 30, idx + 1u, COL_TEXT);
    gfx_number_right(PB_X + PB_W, PB_Y + 30, total, COL_DIM);

    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);
}

static void ctl_draw(void)
{
    uint16_t *back   = gfx_framebuffer();
    uint16_t *front  = (uint16_t *)(g_front ? FB1_ADDR : FB0_ADDR);
    bool      was_ls = gfx_is_landscape();

    gfx_set_orientation(false);
    gfx_set_framebuffer(front);

    gfx_pill(OV_BACK_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_BACK_X + OV_PILL_W / 2, OV_TOP_Y + 16, "返回", COL_TEXT);

    /* 方向那顆直接顯示目前模式（自動／直立／橫向），按下去之前就知道狀態。 */
    gfx_pill(OV_ORIENT_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_ORIENT_X + OV_PILL_W / 2, OV_TOP_Y + 16,
                    ORIENT_NAME[photo_get_orientation()], COL_TEXT);

    gfx_pill(OV_PAUSE_X, OV_TOP_Y, OV_PILL_W, OV_TOP_H, COL_PANEL);
    gfx_text_center(OV_PAUSE_X + OV_PILL_W / 2, OV_TOP_Y + 16,
                    "暫停", COL_ACCENT);

    gfx_set_framebuffer(back);
    gfx_set_orientation(was_ls);

    ov_draw_bar(g_ov_index);
}

/* 回傳動作代碼；-1 = 疊加層以外（＝繼續播放）。
 * 「暫停」那顆只是指示，點它跟點空白處一樣。 */
static int ctl_hit(int x, int y)
{
    if (y >= OV_TOP_Y && y < OV_TOP_Y + OV_TOP_H) {
        if (x >= OV_BACK_X && x < OV_BACK_X + OV_PILL_W) {
            return PAUSE_MENU;
        }
        if (x >= OV_ORIENT_X && x < OV_ORIENT_X + OV_PILL_W) {
            return PAUSE_ROTATE;
        }
    }
    if (y >= PB_Y - PB_HIT && y < PB_Y + PB_H + PB_HIT) {
        return PAUSE_SEEK;
    }
    return -1;
}

/* 疊加層目前有沒有蓋上去。存還原必須成對，所以集中在這兩個函式裡
 * （board-notes 14.5 那個對稱性教訓）。 */
static bool g_ov_shown;

static void ov_show(void)
{
    if (!g_ov_shown) {
        ctl_backup(false);
        ctl_draw();
        g_ov_shown = true;
    }
}

static void ov_hide(void)
{
    if (g_ov_shown) {
        ctl_backup(true);
        g_ov_shown = false;
    }
}

static int paused_loop_inner(void);

/* 只有「剛進暫停」才閃那顆圖示（目前已經不閃了，保留旗標備用）。 */
static bool g_pause_flash;

/* 除錯：SWD 寫入 PAUSE_* 就當成按了那一顆。觸控沒辦法遠端重現，
 * 沒有這個鉤子就只能靠使用者回報。不寫（維持 -1）等於不存在。 */
volatile int32_t  g_dbg_inject = -1;
volatile uint32_t g_dbg_pause_entries;
volatile int32_t  g_dbg_last_action;
volatile int32_t  g_dbg_tx, g_dbg_ty, g_dbg_hit;

/* 所有出口都會經過這裡，不會有「某條路徑忘了還原」的問題。 */
static int paused_loop(void)
{
    int a;

    g_ov_shown = false;
    ov_show();
    a = paused_loop_inner();
    ov_hide();
    return a;
}


static int paused_loop_inner(void)
{
    g_paused    = 1u;
    g_req_pause = 0u;               /* 消化掉進來的那一次 */
    /* 不再閃暫停圖示。控制列跳出來本身就是最清楚的回饋，而那個圖示要停
     * 幾百毫秒，等於每次進暫停都先卡一下。 */
    g_pause_flash = false;
    /* 把上一個動作殘留的觸碰吃掉。放在**進來的時候**而不是「按下去之後」——
     * 按鈕要按下就有反應，不能等手指離開才動作。 */
    wait_release();

    g_dbg_pause_entries++;
    {
    uint32_t ov_until = HAL_GetTick() + OV_MS;

    for (;;) {
        int x0, y0;

        watchdog_feed();
        /* 疊加層過了時間就自己收起來，但**維持暫停** —— 跟影片一樣，
         * 收起來只是讓照片看得完整，不代表繼續播。 */
        if (g_ov_shown && (int32_t)(HAL_GetTick() - ov_until) >= 0) {
            ov_hide();
        }
        if (g_dbg_inject >= 0) {
            int hit = g_dbg_inject;

            g_dbg_inject = -1;
            if (hit != PAUSE_ROTATE) {
                g_paused = 0u;
            }
            g_dbg_last_action = hit;
            return hit;
        }
        if (!sd_present()) {
            g_req_pause = 0u;
            g_paused    = 0u;
            return PAUSE_MENU;
        }
        if (g_req_pause) {
            g_req_pause = 0u;
            g_paused    = 0u;
            flash_icon(false);
            return PAUSE_RESUME;
        }

        if (read_touch(&x0, &y0)) {
            int hit;

            /* 疊加層收起來之後，點一下就是繼續播放。
             *
             * 原本是「先把疊加層叫回來」（照影片那套），但暫停中的疊加層
             * 三秒就收起，使用者等一下再點就一定要點兩下才播得起來 ——
             * 回報的「要慢點兩下」正是這個。點一下切換播放/暫停優先。 */
            if (!g_ov_shown) {
                wait_release();
                g_paused          = 0u;
                g_dbg_last_action = PAUSE_RESUME;
                return PAUSE_RESUME;
            }
            ov_until = HAL_GetTick() + OV_MS;   /* 有互動就延長 */
            hit = ctl_hit(x0, y0);

            g_dbg_touch_hit++;
            g_dbg_tx  = x0;
            g_dbg_ty  = y0;
            g_dbg_hit = hit;

