chunyen627-afk/stm32h7s78-project/projects/album/app_src/album_main.c
            if (hit == PAUSE_SEEK) {
                /* 拉桿改成**相對手勢**：往左拉＝上一張、往右拉＝下一張。
                 *
                 * 不做「拖到哪就是第幾張」的絕對定位 —— 四千多張照片攤在
                 * 400px 上，一個像素就是十張，手指根本停不到想要的那張；
                 * 而且每張要解 1.5 秒，絕對定位很容易一路解過去。
                 *
                 * 取整段過程中的**最大位移**而不是放開瞬間的位置，並容忍
                 * 中途漏報 —— 快速滑動時控制器會掉幾筆座標
                 * （board-notes 14.7）。 */
                uint32_t seen = HAL_GetTick();
                int      dx = 0, x, y;

                for (;;) {
                    watchdog_feed();
                    if (read_touch(&x, &y)) {
                        int d = x - x0;

                        if (((d < 0) ? -d : d) > ((dx < 0) ? -dx : dx)) {
                            dx = d;
                        }
                        seen = HAL_GetTick();
                    } else if ((HAL_GetTick() - seen) > SWIPE_GAP_MS) {
                        break;              /* 真的放開了 */
                    }
                    nap(10);
                }
                if (dx <= -SEEK_MIN_DX) {
                    g_paused          = 0u;
                    g_dbg_last_action = PAUSE_PREV;
                    return PAUSE_PREV;
                }
                if (dx >= SEEK_MIN_DX) {
                    g_paused          = 0u;
                    g_dbg_last_action = PAUSE_NEXT;
                    return PAUSE_NEXT;
                }
                /* 拉得不夠：當成沒按到，留在暫停。 */
                ov_until = HAL_GetTick() + OV_MS;
                continue;
            }

            if (hit >= 0) {
                /* 按下就回報，不等手指離開。切方向要留在暫停，
                 * 讓使用者當場看到結果。 */
                if (hit != PAUSE_ROTATE) {
                    g_paused = 0u;
                }
                g_dbg_last_action = hit;
                return hit;
            }

            /* 疊加層以外 = 繼續播放。
             *
             * 這條**一定要等手指離開才回報**：恢復播放之後播放迴圈也在看
             * 觸控，同一次觸碰會立刻又被判成「暫停」—— 使用者看到的就是
             * 「點一下播放不了」。翻頁那幾條不會有這個問題，因為後面接著
             * 1.5 秒的解碼，手指早就離開了。 */
            wait_release();
            g_paused          = 0u;
            g_dbg_last_action = PAUSE_RESUME;
            return PAUSE_RESUME;
        }
        nap(8);
    }
    }
}


/* 等目前這張照片的展示時間走完。
 *
 * already_ms 是「這張已經在螢幕上待了多久」—— 也就是解下一張花掉的時間。
 * 解碼期間前一張本來就在螢幕上，那段時間當然要算進展示時間裡，否則使用者
 * 設 2 秒會變成「解碼 1.5 秒 + 等 2 秒 = 3.5 秒」，設定值和實際對不上。
 *
 * 回傳 0 = 正常等完，1 = 要離開播放，2 = 卡片被拔掉，
 *     3 = 暫停中按了上一張，4 = 下一張。 */
static int wait_interval(uint32_t already_ms)
{
    uint32_t wait_ms = g_interval_s * 1000u;
    uint32_t waited  = (already_ms > wait_ms) ? wait_ms : already_ms;
    uint32_t last    = HAL_GetTick();

    while (waited < wait_ms) {
        uint32_t now;

        watchdog_feed();
        if (!sd_present()) {
            return 2;
        }
        if (!screen_poll()) {
            /* 亮度 0（螢幕關著）：不累計時間，再點亮時這張還有完整時間。 */
            nap(100);
            last = HAL_GetTick();
            continue;
        }

        now = HAL_GetTick();
        waited += now - last;
        last = now;

        if (g_req_pause) {
            return 3;               /* 交給 slideshow 統一處理暫停 */
        }

        /* 播放中點一下畫面就暫停並叫出控制列。
         *
         * 原本只有實體鍵能暫停，而滑動手勢只在暫停中才有作用 —— 等於
         * 「要先知道有那顆按鍵，才進得去操作介面」。點畫面是最直覺的入口，
         * 而且跟影片播放器的操作方式一致。 */
        {
            int tx, ty;

            if ((HAL_GetTick() - g_resume_ms) > RESUME_GUARD_MS &&
                read_touch(&tx, &ty)) {
                (void)tx; (void)ty;
                /* 不在這裡等放開 —— paused_loop_inner 進來就會吃掉殘留的
                 * 觸碰。在這裡等等於讓「點一下叫出控制列」多花兩百毫秒。 */
                return 3;
            }
        }
        nap(15);
    }
    return 0;
}

/* 暫停期間的互動，含翻頁。
 *
 * 翻頁之後要「留在暫停」，所以這裡是個迴圈：paused_loop() 回報翻頁就解碼
 * 並顯示，然後再進 paused_loop() 等下一個指令，直到使用者要繼續或回選單。
 *
 * 先前這段邏輯散在 wait_interval 和 slideshow 兩處，而 wait_interval 只判斷
 * 「是不是回選單」，翻頁的回傳值被當成沒事發生 —— 症狀就是滑動翻了頁卻
 * 立刻自動繼續播放。集中在一個地方就不會再漏。
 *
 * *cur 進來是目前顯示的索引，出去是最後顯示的那張。
 * 回傳 0 = 繼續播放，1 = 回選單。 */
static int pause_session(int32_t *cur)
{
    g_pause_flash = true;
    for (;;) {
        int a;

        /* 疊加層的拉桿要顯示目前是第幾張。 */
        g_ov_index = (uint32_t)((*cur < 0) ? 0 : *cur);
        a = paused_loop();
        int dir;
        uint32_t target, tries;
        photo_result_t r;

        if (a == PAUSE_MENU) {
            return 1;
        }
        if (a == PAUSE_RESUME) {
            g_resume_ms = HAL_GetTick();
            return 0;
        }

        if (a == PAUSE_ROTATE) {
            /* 自動 <-> 固定，不再三段循環。離開自動時凍結在**目前這張的
             * 方向** —— 使用者看到什麼就固定什麼，畫面不會按一下就翻掉。 */
            if (photo_get_orientation() == PHOTO_ORIENT_AUTO) {
                photo_set_orientation(gfx_is_landscape()
                                      ? PHOTO_ORIENT_LANDSCAPE
                                      : PHOTO_ORIENT_PORTRAIT);
            } else {
                photo_set_orientation(PHOTO_ORIENT_AUTO);
            }
            /* 重畫目前這張，讓使用者當場看到新方向的結果。 */
            if (*cur >= 0 &&
                photo_show(PLAYLIST_BASE + g_order[*cur] * PATH_MAX)
                    == PHOTO_OK) {
                present();
            }
            flash_orient();
            continue;
        }

        /* 翻頁：往指定方向找一張解得開的，最多繞一圈。 */
        dir    = (a == PAUSE_PREV) ? -1 : 1;
        target = (uint32_t)((*cur < 0) ? 0 : *cur);
        tries  = 0;
        r      = PHOTO_ERR_READ;

        while (tries < g_order_count) {
            watchdog_feed();
            target = (target + g_order_count + (uint32_t)dir) % g_order_count;
            r = photo_show(PLAYLIST_BASE + g_order[target] * PATH_MAX);
            tries++;
            if (r == PHOTO_OK || r == PHOTO_ABORTED) {
                break;
            }
            g_decode_fail++;
        }
        if (r == PHOTO_OK) {
            present();
            *cur = (int32_t)target;
            g_decode_ok++;
        }
    }
}

/* 播放。
 *
 * 解碼與顯示重疊：目前這張在螢幕上的時候，就先把下一張解進另一塊 buffer，
 * 時間到直接切換。這樣換頁是瞬間的，而且間隔設定值就是實際的展示時間 ——
 * 只要解碼比間隔快。解碼比間隔慢的話，展示時間就等於解碼時間，沒辦法更快。 */
static void slideshow(void)
{
    uint32_t pos = 0;           /* 下一張要解碼的 g_order 索引 */
    int32_t  cur = -1;          /* 顯示中的索引，-1 = 還沒顯示過 */

    wait_release();

